### Import required dependencies

In [1]:
import pandas as pd
import os
import numpy as np

## Deliverable 1: Collect the Data

To collect the data that you’ll need, complete the following steps:

1. Using the Pandas `read_csv` function and the `os` module, import the data from the `new_full_student_data.csv` file, and create a DataFrame called student_df. 

2. Use the head function to confirm that Pandas properly imported the data.

In [2]:
# Create the path and import the data
full_student_data = os.path.join('../Resources/new_full_student_data.csv')
student_df = pd.read_csv(full_student_data)

In [3]:
# Verify that the data was properly imported
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

## Deliverable 2: Prepare the Data

To prepare and clean your data for analysis, complete the following steps:
    
1. Check for and remove all rows with `NaN`, or missing, values in the student DataFrame. 

2. Check for and remove all duplicate rows in the student DataFrame.

3. Use the `str.replace` function to remove the "th" from the grade levels in the grade column.

4. Check data types using the `dtypes` property.

5. Remove the "th" suffix from every value in the grade column using `str` and `replace`.

6. Change the grade colum to the `int` type and verify column types.

7. Use the head (and/or the tail) function to preview the DataFrame.

In [4]:
# Check for null values
student_copy= student_df.copy()

student_copy.isnull().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [5]:
# Drop rows with null values and verify removal
student_na=student_copy.dropna()
student_na.isnull().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [6]:
# Check for duplicated rows
student_na.duplicated().sum()

1836

In [7]:
# Drop duplicated rows and verify removal
student_ndf=student_na.drop_duplicates()
student_ndf.duplicated().sum()

0

In [8]:
# Check data types
student_ndf.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [9]:
# Examine the grade column to understand why it is not an int
s_grade = student_ndf.loc[:,"grade"]
s_grade

0         9th
1         9th
2         9th
3         9th
5         9th
         ...
19508    10th
19509    12th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 14831, dtype: object

In [10]:
# Remove the non-numeric characters and verify the contents of the column
s_grade_int = s_grade.str.replace("th","")
s_grade_int

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [11]:
# Change the grade column to the int type and verify column types
grade_int=s_grade_int.astype("int64")
grade_int

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: int64

## Deliverable 3: Summarize the Data

Describe the data using summary statistics on the data as a whole and on individual columns.

1. Generate the summary statistics for each DataFrame by using the `describe` function.

2. Display the mean math score using the `mean` function. 

2. Store the minimum reading score as `min_reading_score`.

In [12]:
# Display summary statistics for the DataFrame
student_ndf.describe()

         student_id  reading_score    math_score  school_budget
count  1.483100e+04   14831.000000  14831.000000   14831.000000
mean   6.975296e+07      72.357865     64.675733  893742.749107
std    3.452909e+07      15.224590     15.844093   53938.066467
min    1.000906e+07      10.500000      3.700000  817615.000000
25%    3.984433e+07      62.200000     54.500000  846745.000000
50%    6.965978e+07      73.800000     65.300000  893368.000000
75%    9.927449e+07      84.000000     76.000000  956438.000000
max    1.299997e+08     100.000000    100.000000  991918.000000

In [13]:
# Display the mean math score using the mean function
math_mean = student_ndf.loc[:,"math_score"].mean()
math_mean

64.67573326141189

In [14]:
# Store the minimum reading score as min_reading_score
min_read = student_ndf.loc[:,"reading_score"].min()
min_read

10.5

## Deliverable 4: Drill Down into the Data

Drill down to specific rows, columns, and subsets of the data.

To drill down into the data, complete the following steps:

1. Use `loc` to display the grade column.

2. Use `iloc` to display the first 3 rows and columns 3, 4, and 5.

3. Show the rows for grade nine using `loc`.

4. Store the row with the minimum overall reading score as `min_reading_row` using `loc` and the `min_reading_score` found in Deliverable 3.

5. Find the reading scores for the school and grade from the output of step three using `loc` with multiple conditional statements.

6. Using conditional statements and `loc` or `iloc`, find the mean reading score for all students in grades 11 and 12 combined.

In [16]:
# Use loc to display the grade column
s_grade_int = s_grade.str.replace("th","")
s_grade_int = student_ndf.loc[:,"grade"].astype("object")
s_grade_int

0         9th
1         9th
2         9th
3         9th
5         9th
         ...
19508    10th
19509    12th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 14831, dtype: object

In [17]:
# Use `iloc` to display the first 3 rows and columns 3, 4, and 5.
tri_row = student_ndf.iloc[0:3,[3,4,5]]
tri_row

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [18]:
# Select the rows for grade nine and display their summary statistics using `loc` and `describe`.
grade_nine= student_ndf.loc[student_ndf["grade"]=="9th"]
grade_nine.describe()

         student_id  reading_score   math_score  school_budget
count  4.132000e+03    4132.000000  4132.000000    4132.000000
mean   6.979441e+07      69.236713    66.585624  898692.606002
std    3.470565e+07      15.277354    16.661533   54891.596611
min    1.000906e+07      17.900000     5.300000  817615.000000
25%    3.953848e+07      59.000000    56.000000  846745.000000
50%    6.984037e+07      70.050000    67.800000  893368.000000
75%    9.939504e+07      80.500000    78.500000  957299.000000
max    1.299997e+08      99.900000   100.000000  991918.000000

In [19]:
# Store the row with the minimum overall reading score as `min_reading_row`
# using `loc` and the `min_reading_score` found in Deliverable 3.
min_read = student_ndf["reading_score"].min()
min_read_row = student_ndf.loc[student_ndf["reading_score"]==min_read]
min_read_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10th,Dixon High School,10.5,58.4,Charter,870334

In [23]:
# Use loc with conditionals to select all reading scores from 10th graders at Dixon High School.

grade_ten = student_ndf.loc[(student_ndf["grade"]=="10th")|
                            (student_ndf["school_name"]=="Dixon High School")]
grade_ten.describe()

         student_id  reading_score   math_score  school_budget
count  5.412000e+03    5412.000000  5412.000000    5412.000000
mean   7.021040e+07      72.773596    65.329619  891468.730783
std    3.468504e+07      15.068265    15.296731   52534.391484
min    1.001891e+07      10.500000     3.700000  817615.000000
25%    4.010427e+07      62.700000    55.900000  846745.000000
50%    7.033371e+07      74.100000    66.200000  870334.000000
75%    1.004815e+08      84.400000    76.100000  956438.000000
max    1.299004e+08     100.000000   100.000000  991918.000000

In [27]:
# Find the mean reading score for all students in grades 11 and 12 combined.
grade_e_t = student_ndf.loc[(student_ndf["grade"]=="11th")|(student_ndf["grade"]=="12th")]
e_t_mean = grade_e_t.loc[:,"reading_score"].mean()
e_t_mean

74.90038089192188

## Deliverable 5: Make Comparisons Between District and Charter Schools

Compare district vs charter schools for budget, size, and scores.

Make comparisons within your data by completing the following steps:

1. Using the `groupby` and `mean` functions, look at the average reading and math scores per school type.

1. Using the `groupby` and `count` functions, find the total number of students at each school.

2. Using the `groupby` and `mean` functions, find the average budget per grade for each school type.

In [103]:
# Use groupby and mean to find the average reading and math scores for each school type.
groupby_s_r_m = student_ndf.groupby(["school_type","reading_score","math_score"])
groupby_s_r_m.mean()

                                       student_id  school_budget
school_type reading_score math_score
Charter     10.5          58.4         81758630.0       870334.0
            11.3          81.3        121722762.0       870334.0
            14.2          45.2         38804993.0       960726.0
                          95.6         71849627.0       870334.0
            18.6          76.7        125601876.0       893368.0
...                                           ...            ...
Public      99.9          78.5         28997593.0       956438.0
                          80.0         38714083.0       817615.0
            100.0         61.4         47461327.0       846745.0
                          63.8         63851186.0       991918.0
                          72.8         45424751.0       846745.0

[14657 rows x 2 columns]

In [91]:
# Use the `groupby`, `count`, and `sort_values` functions to find the
# total number of students at each school and sort from most students to least students.
c_student = student_ndf.groupby(["school_name"])["school_name"].count()
s_student = c_student.sort_values(axis=0,ascending  = False)
s_student

school_name
Montgomery High School    2038
Green High School         1961
Dixon High School         1583
Wagner High School        1541
Silva High School         1109
Woods High School         1052
Sullivan High School       971
Turner High School         846
Bowers High School         803
Fisher High School         798
Richard High School        551
Campos High School         541
Odonnell High School       459
Campbell High School       407
Chang High School          171
Name: school_name, dtype: int64

In [100]:
t_student = student_ndf.groupby(['school_type','grade'])['math_score'].mean()
t_student

school_type  grade
Charter      10th     66.443206
             11th     68.024735
             12th     60.212121
             9th      70.077874
Public       10th     63.764121
             11th     59.314337
             12th     63.568319
             9th      63.771066
Name: math_score, dtype: float64

# Deliverable 6: Summarize Your Findings
In the cell below, write a few sentences to describe any discoveries you made while performing your analysis along with any additional analysis you believe would be worthwhile.

*In this challenge we learned about how to extract data from the csv, and using loc and iloc function to sort and organize data into our preference.
Remove and replace datatypes using replace function, groupby data into useful pivot table.
Also we learned about using describe function to easily bring out std , mean , min and etc.
In this challenge we discoverd Montgomery High School has the most student participate in this test, Charter school type has high average math score vs the average Public school students*